package com.melon.bot.core.common

const val tag = "빵구봇"
const val targetPackageName = "com.kakao.talk"
const val replyActionIndex = 1
const val openChatRoomName = "\uD83E\uDEBB제노 xeno 추상하는 능력을 고양시키는 대화"
// const val openChatRoomName = "빵구방9101"
const val hostKeyword = "."
const val helpKeyword = "?"
const val timerKeyword = "t"
const val endKeyword = "e"

val jobArray = arrayOf(
    "의사", "간호사", "약사", "치과의사", "수의사", "임상병리사", "방사선사", "물리치료사", "임상심리사", "사회복지사",
    "변호사", "판사", "검사", "경찰관", "소방관", "교사", "교수", "유치원 교사", "언어 치료사", "상담사",
    "심리학자", "경제학자", "인류학자", "역사학자", "사회학자", "정치학자", "통계학자", "연구원", "과학자", "기후학자",
    "화학자", "물리학자", "생물학자", "지리학자", "고고학자", "기계공학자", "전기공학자", "컴퓨터공학자", "소프트웨어 엔지니어", "웹 개발자",
    "데이터 과학자", "데이터 엔지니어", "네트워크 관리자", "시스템 관리자", "인공지능 연구원", "로봇공학자", "UX/UI 디자이너", "게임 개발자", "애니메이터", "그래픽 디자이너",
    "산업 디자이너", "패션 디자이너", "광고 기획자", "마케팅 전문가", "홍보 담당자", "콘텐츠 크리에이터", "작가", "편집자", "출판 기획자", "번역가",
    "통역사", "저널리스트", "방송 PD", "아나운서", "라디오 진행자", "영화 감독", "사진작가", "음악 프로듀서", "작곡가", "연주자",
    "가수", "배우", "무용가", "모델", "무대 감독", "조명 기사", "음향 엔지니어", "조경사", "정원사", "농업인",
    "축산업자", "어부", "요리사", "제과사", "바리스타", "호텔리어", "여행 가이드", "항공 승무원", "항공 조종사", "비행 교관",
    "선장", "자동차 정비사", "전기 기술자", "배관공", "목수", "건축가", "토목 엔지니어", "도시 계획가", "환경 공학자", "품질 관리 전문가",
    "판매원", "경영 컨설턴트", "회계사", "세무사", "재무 분석가", "자산 관리자", "보험 설계사", "부동산 중개인", "투자 분석가", "벤처 캐피털리스트"
)

val arrayOfPlaces = arrayOf(
    "서점", "학교", "공원", "병원", "도서관", "카페", "영화관", "슈퍼마켓", "쇼핑몰", "미술관",
    "박물관", "공항", "기차역", "버스터미널", "경찰서", "소방서", "은행", "약국", "음식점", "헬스장",
    "수영장", "미용실", "동물병원", "놀이공원", "수족관", "식물원", "보육원", "유치원", "초등학교", "중학교",
    "고등학교", "대학교", "학원", "편의점", "빵집", "옷가게", "문구점", "꽃집", "노래방", "PC방",
    "당구장", "볼링장", "테니스장", "축구장", "야구장", "농구장", "배드민턴장", "스케이트장", "요가 학원", "무도관",
    "공연장", "운동장", "시장", "주유소", "우체국", "시청", "구청", "동사무소", "문화회관", "도심광장",
    "해변", "산책로", "등산로", "호수", "강변", "캠핑장", "정원", "마을회관", "사찰", "성당",
    "교회", "묘지", "터미널", "커뮤니티 센터", "휴게소", "도랑길", "고속도로 휴게소", "주차장", "연못", "산장",
    "펜션", "호텔", "여관", "콘도", "리조트", "민박", "서핑장", "스키장", "골프장", "마라톤 코스",
    "패스트푸드점", "아울렛", "사진관", "경기장", "놀이방", "패션매장", "대형마트", "상가", "레스토랑", "도예 체험장"
)