package com.melon.bot.core.common

const val tag = "메론빵봇"
const val targetPackageName = "com.kakao.talk"
const val replyActionIndex = 1
const val openChatRoomName = "평화토론방\uD83E\uDEBD"
const val hostKeyword = "."
const val helpKeyword = "?"

val jobArray = arrayOf(
    "의사", "간호사", "약사", "치과의사", "수의사", "임상병리사", "방사선사", "물리치료사", "임상심리사", "사회복지사",
    "변호사", "판사", "검사", "경찰관", "소방관", "교사", "교수", "유치원 교사", "언어 치료사", "상담사",
    "심리학자", "경제학자", "인류학자", "역사학자", "사회학자", "정치학자", "통계학자", "연구원", "과학자", "기후학자",
    "화학자", "물리학자", "생물학자", "지리학자", "고고학자", "기계공학자", "전기공학자", "컴퓨터공학자", "소프트웨어 엔지니어", "웹 개발자",
    "데이터 과학자", "데이터 엔지니어", "네트워크 관리자", "시스템 관리자", "인공지능 연구원", "로봇공학자", "UX/UI 디자이너", "게임 개발자", "애니메이터", "그래픽 디자이너",
    "산업 디자이너", "패션 디자이너", "광고 기획자", "마케팅 전문가", "홍보 담당자", "콘텐츠 크리에이터", "작가", "편집자", "출판 기획자", "번역가",
    "통역사", "저널리스트", "방송 PD", "아나운서", "라디오 진행자", "영화 감독", "사진작가", "음악 프로듀서", "작곡가", "연주자",
    "가수", "배우", "무용가", "모델", "무대 감독", "조명 기사", "음향 엔지니어", "조경사", "정원사", "농업인",
    "축산업자", "어부", "요리사", "제과사", "바리스타", "호텔리어", "여행 가이드", "항공 승무원", "항공 조종사", "비행 교관",
    "선장", "자동차 정비사", "전기 기술자", "배관공", "목수", "건축가", "토목 엔지니어", "도시 계획가", "환경 공학자", "품질 관리 전문가",
    "판매원", "경영 컨설턴트", "회계사", "세무사", "재무 분석가", "자산 관리자", "보험 설계사", "부동산 중개인", "투자 분석가", "벤처 캐피털리스트"
)